**pandas.DataFrame.iloc**

loc in pandas is to access a group of rows and columns by label(s) or a boolean array.

In [0]:
import pandas as pd

df = pd.DataFrame([[1, 2], [4, 5], [7, 8]], index=['row1', 'row2', 'row3'], columns=['column1_value', 'column2_value'])

In [6]:
df

      column1_value  column2_value
row1              1              2
row2              4              5
row3              7              8

In [7]:
df.loc['row1']

column1_value    1
column2_value    2
Name: row1, dtype: int64

In [8]:
df.loc['row2']

column1_value    4
column2_value    5
Name: row2, dtype: int64

In [9]:
df.loc[['row2', 'row3']]

      column1_value  column2_value
row2              4              5
row3              7              8

**pandas.DataFrame.iloc**

Purely integer-location based indexing for selection by position.

In [10]:
mydict = [{'a': 1, 'b': 2, 'c': 3, 'd': 4},
          {'a': 100, 'b': 200, 'c': 300, 'd': 400},
          {'a': 1000, 'b': 2000, 'c': 3000, 'd': 4000 }]
mydict

[{'a': 1, 'b': 2, 'c': 3, 'd': 4},
 {'a': 100, 'b': 200, 'c': 300, 'd': 400},
 {'a': 1000, 'b': 2000, 'c': 3000, 'd': 4000}]

In [12]:
df = pd.DataFrame(mydict)
df

      a     b     c     d
0     1     2     3     4
1   100   200   300   400
2  1000  2000  3000  4000

In [13]:
type(df.iloc[0])

pandas.core.series.Series

In [14]:
# check the row 0 values
df.iloc[0]

a    1
b    2
c    3
d    4
Name: 0, dtype: int64

In [15]:
type(df.iloc[[0]])

pandas.core.frame.DataFrame

In [16]:
df.iloc[[0]]

   a  b  c  d
0  1  2  3  4

In [17]:
df.iloc[:3]

      a     b     c     d
0     1     2     3     4
1   100   200   300   400
2  1000  2000  3000  4000

In [18]:
#To selects the rows whose index label even
df.iloc[lambda x: x.index % 2 == 0]

      a     b     c     d
0     1     2     3     4
2  1000  2000  3000  4000

In [19]:
df.iloc[0, 1]

2

In [20]:
# Check the value of row 1 and column 2 of table
df.iloc[1, 2]

300

In [23]:
# check the value of row 0 and row 2 with column 0 and column 3
df.iloc[[0, 2], [0, 3]]

      a     d
0     1     4
2  1000  4000